blog-posts/2004-02-23-plannerel-broken-up-into-lots-of-little-files.org
#+TITLE: planner.el broken up into lots of little files

February 23rd, 2004 -
[[http://sachachua.com/blog/p/1751][http://sachachua.com/blog/p/1751]]

It should compile cleanly under Emacs 21.3 (CVS). I'm still trying to
 figure out how to install the fsf-compat package under XEmacs so that
 I can get it to compile cleanly there.

WARNING! Many user-visible changes. In particular, you will now need
 to require a bunch of other things in order to get the old behavior. I
 should figure out how to set up the appropriate autoloads. In the
 meantime, add some variant of the following to your .emacs:

#+BEGIN_EXAMPLE
    (require 'remember)
    (require 'planner)
    (require 'remember-planner)
    (require 'planner-experimental)
    (require 'planner-bbdb)
    ;; (require 'planner-diary)
    (require 'planner-gnus)
    (require 'planner-id)
    ;; (require 'planner-notes)
    (require 'planner-rss)
    ;; (require 'planner-schedule)
    ;; (require 'planner-timeclock)
    (require 'planner-w3m)
#+END_EXAMPLE

This will no doubt break a number of things. Please complain loudly.
 If you want the old version, you can get a tar.gz from

[[http://sacha.free.net.ph/notebook/emacs/planner/planner-current.tar.gz][http://sacha.free.net.ph/notebook/emacs/planner/planner-current.tar.gz]]
 .
